# PercentageSkylights Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..PercentageSkylights Property
MassSurfaceData Class See Also
---
The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double PercentageSkylights { get; set; }
```

Visual Basic
---
```text
Public Property PercentageSkylights As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
```

# Remarks
The resulting coverage of the roof with skylights is not guaranteed to match this value. It is a target.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The percentage skylights value is between 0.00 and 0.95. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace